Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: Then you very likely have a crashed edit session that is worth recovering. If the date of the file is newer than the date of the swap file, then either it was changed after the crash (perhaps you recovered it earlier, but didn't delete the swap file?), or else the file was saved before the crash but after the last write of the swap file (then you're lucky: you don't even need that old swap file). Vim will warn you for this with this extra line:
es_es: Entonces es muy probable que haya ocurrido algo con la sesión. Si la fecha del archivo es posterior a la fecha del archivo de intercambio, es que o cambiado tras el cuelgue (quizá la recuperó antes y no eliminó el archivo de intercambio), o es que el archivo fue guardado después de la última grabación del archivo de intercambio (entonces tienes suerte: no necesita ni ese viejo archivo de intercambio). Vim le advertirá de esto:

source: NEWER than swap file! ~
es_es: MÁS NUEVO que el archivo de intercambio! ~

source: [cannot be read] ~
es_es: [no se puede leer] ~

source: will appear under the name of the swap file. This can be good or bad, depending on circumstances.
es_es: aparecerá bajo el nombre del archivo de intercambio. Esto puede ser bueno o malo dependiendo de las circunstancias.

source: It is good if a previous editing session crashed without having made any changes to the file. Then a directory listing of the swap file will show that it has zero bytes. You may delete it and proceed.
es_es: Son buenas noticias si la sesión anterior se colgó sin haber hecho ningún cambio al archivo. En tal caso un listado de archivos del directorio mostrará que tiene cero bytes. Tal vez quiera eliminarla y continuar.

source: It is slightly bad if you don't have read permission for the swap file. You may want to view the file read-only, or quit. On multi-user systems, if you yourself did the last changes under a different login name, a logout followed by a login under that other name might cure the "read error". Or else you might want to find out who last edited (or is editing) the file and have a talk with them.
es_es: No son muy buenas noticias si lo que ocurre es que no tiene permisos de lectura del archivo de intercambio. Tal vez desee ver el archivo en modo sólo lectura o salir. En sistemas multiusuario, si empleó otro usuario, salir y volver a identificarte tal vez resuelva el «error de lectura». O en su defecto quizá quiera encontrar quien lo editó por última vez (o está editándolo ahora mismo) y hablar con él.

source: It is very bad if it means there is a physical read error on the disk containing the swap file. Fortunately, this almost never happens. You may want to view the file read-only at first (if you can), to see the extent of the changes that were "forgotten". If you are the one in charge of that file, be prepared to redo your last changes.
es_es: Son muy malas noticias si significa que hay un error de lectura a nivel físico del disco duro. Afortunadamente, esto no ocurre casi nunca. Quizá quiera ver el archivo en modo sólo lectura inicialmente (si puede), para ver el alcance de los cambios que fueron «olvidados». Si eres el que está a cargo del archivo, prepárate para rehacer los últimos cambios.

source: WHAT TO DO? *swap-exists-choices*
es_es: ¿QUÉ HACER? *swap-exists-choices*

source: O Open the file readonly. Use this when you just want to view the file and don't need to recover it. You might want to use this when you know someone else is editing the file, but you just want to look in it and not make changes.
es_es: O Abrir el archivo en modo sólo lectura. Use esto cuando sólo desee ver el archivo y no necesite recuperarlo. Tal vez quiera usar esto cuando sepa que alguien está usando el archivo y usted sólo quiera echar un vistazo sin hacer cambios.

source: E Edit the file anyway. Use this with caution! If the file is being edited in another Vim, you might end up with two versions of the file. Vim will try to warn you when this happens, but better be safe then sorry.
es_es: E Editar el archivo igualmente. ¡Use esto con cuidado! Si el archivo está siendo utilizado por otro Vim, terminará con dos versiones del archivo. Vim intentará advertirte si esto va a ocurrir, pero más vale prevenir.

source: R Recover the file from the swap file. Use this if you know that the swap file contains changes that you want to recover.
es_es: R Recuperar el archivo del archivo de intercambio. Emplee esto si sabe que el archivo de intercambio contiene los cambios que desea.

source: A Abort. Like Quit, but also abort further commands. This is useful when loading a script that edits several files, such as a session with multiple windows.
es_es: A Abortar. Como salir (Q), pero también aborta las órdenes posteriores. Esto es útil cuando cargue un script que edita varios archivos, como una sesión con múltiples ventanas.

source: D Delete the swap file. Use this when you are sure you no longer need it. For example, when it doesn't contain changes, or when the file itself is newer than the swap file. On Unix this choice is only offered when the process that created the swap file does not appear to be running.
es_es: D Eliminar el archivo de intercambio. Use esto cuando esté seguro de que no lo necesita. Por ejemplo, cuando no contenga cambios o cuando el archivo en sí sea más nuevo que el archivo de intercambio. En Unix esta opción sólo se ofrece cuando el proceso que creó el archivo de intercambio no parece que estar en ejecución.

source: If you do not get the dialog (you are running a version of Vim that does not support it), you will have to do it manually. To recover the file, use this command: >
es_es: Si no ve el diálogo (está ejecutando una versión de Vim que no lo soporta, tendrá que hacerlo a mano. Para recuperar el archivo, use la siguiente orden: >

source: Vim cannot always detect that a swap file already exists for a file. This is the case when the other edit session puts the swap files in another directory or when the path name for the file is different when editing it on different machines. Therefore, don't rely on Vim always warning you.
es_es: Vim no puede siempre detectar cuando ya existe un archivo de intercambio para un archivo. Este es el caso cuando otras sesiones de edición ponen los archivos en otro directorio o cuando una ruta de archivo difiere en máquinas distintas. Por lo tanto, no confíe en que Vim siempre le vaya a alertar.

source: If you really don't want to see this message, you can add the 'A' flag to the 'shortmess' option. But it's very unusual that you need this.
es_es: Si realmente no quiere ver este mensaje, puede añadir la opción 'A' a la opción 'shortmess'. Pero es poco habitual que lo necesite.

source: *11.4* Further reading
es_es: *11.4* Más información

source: |swap-file| An explanation about where the swap file will be created and what its name is. |:preserve| Manually flushing the swap file to disk. |:swapname| See the name of the swap file for the current file. 'updatecount' Number of key strokes after which the swap file is flushed to disk. 'updatetime' Timeout after which the swap file is flushed to disk. 'swapsync' Whether the disk is synced when the swap file is flushed. 'directory' List of directory names where to store the swap file. 'maxmem' Limit for memory usage before writing text to the swap file. 'maxmemtot' Same, but for all files in total.
es_es: |swap-file| Una explicación sobre dónde se creará el archivo de intercambio y cuál es su nombre. |:preserve| Volcado manual de un archivo de intercambio al disco. |:swapname| Ver el nombre del archivo de intercambio para el actual. 'updatecount' Número de pulsación tras las cuales el archivo de intercambio es volcado al disco. 'updatetime' Temporizador tras el cuál se producirá el volcado a disco. 'swapsync' Si se debe sincornizar el disco duro tras el volcado. 'directory' Listado de directorios para el archivo de intercambio. 'maxmem' Limitar el uso de memoria antes de hacer el volcado. 'maxmemtot' Lo mismo pero incluyendo todos los archivos en total.

source: *usr_22.txt* For Vim version 7.3. Last change: 2010 Feb 21
es_es: *usr_22.esx* Para Vim version 7.3. Último cambio: 21/2/2010

source: Finding the file to edit
es_es: Encontrar el archivo a editar

source: |22.1| The file browser |22.2| The current directory |22.3| Finding a file |22.4| The buffer list
es_es: |22.1| El explorador de archivos |22.2| El directorio actual |22.3| Encontrar un archivo |22.4| La lista de búfers

source: Next chapter: |usr_23.txt| Editing other files Previous chapter: |usr_21.txt| Go away and come back Table of contents: |usr_toc.txt|
es_es: Capítulo siguiente: |usr_23.esx| Editar otros archivos Capítulo anterior: |usr_21.est| Abandonar el editor y volver Tabla de contenidos: |usr_toc.est|

source: *22.1* The file browser
es_es: *22.1* El explorador de archivos

source: Vim has a plugin that makes it possible to edit a directory. Try this: >
es_es: Vim tiene una extensión que permita editar un directorio. Pruebe esto: >

source: Through the magic of autocommands and Vim scripts, the window will be filled with the contents of the directory. It looks like this:
es_es: Mediante la magia de las autoórdenes y de scripts de Vim, la pantalla mostrará los contenidos del directorio. Tiene este aspecto:

source: 1. The name of the browsing tool and its version number 2. The name of the browsing directory 3. The method of sorting (may be by name, time, or size) 4. How names are to be sorted (directories first, then *.h files, *.c files, etc) 5. How to get help (use the <F1> key), and an abbreviated listing of available commands 6. A listing of files, including "../", which allows one to list the parent directory.
es_es: 1. El nombre de la herramienta de exploración y su número de versión 2. El nombre del directorio presente 3. La directriz de ordenación (puede ser por nombre, tiempo o tamaño) 4. El orden de aparición de los nombres (primero directorios, después archivos *.h, archivos *.c, etc) 5. Cómo obtener ayuda (use la tecla <F1>), y una lista abreviada de las órdenes disponibles 6. Una lista de archivos, incluyendo «../», que permite acceder al al directorio padre.

source: You can use Normal mode Vim commands to move around in the text. For example, move the cursor atop a file and press <Enter>; you will then be editing that file. To go back to the browser use ":edit ." again, or use ":Explore". CTRL-O also works.
es_es: Puede usar las órdenes de Vim en el modo normal para desplazarse a a través del texto. Por ejemplo, mueva el cursor al inicio del archivo y pulse <Intro>; estará ahora editando ese archivo. Para volver al explorador, use «:edit» otra vez, o use «:Explore». CTRL-O también funciona.

source: Try using <Enter> while the cursor is atop a directory name. The result is that the file browser moves into that directory and displays the items found there. Pressing <Enter> on the first directory "../" moves you one level higher. Pressing "-" does the same thing, without the need to move to the "../" item first.
es_es: Use <Intro> mientras el cursor está sobre un nombre de directorio. El el resultado es que el explorador de archivos entra en ese directorio y muestra los elementos que ahí se encuentran. Si pulsa <Intro> en el primer directorio «../», se desplazará al nivel superior. Pulsar «-» realiza la misma acción, sin la necesidad de posicionarse primero sobre el elemento «../».

source: You can press <F1> to get help on the things you can do in the netrw file browser. This is what you get: >
es_es: Puede obtener ayuda pulsando <F1> referente a las acciones que puede realizar en el explorador de archivos netrw. A continuación verá lo que obtiene.

source: MAPS netrw-maps <F1>.............Help.......................................|netrw-help| <cr>.............Browsing...................................|netrw-cr| <del>............Deleting Files or Directories..............|netrw-delete| -................Going Up...................................|netrw--| a................Hiding Files or Directories................|netrw-a| mb...............Bookmarking a Directory....................|netrw-mb| gb...............Changing to a Bookmarked Directory.........|netrw-gb| c................Make Browsing Directory The Current Dir....|netrw-c| d................Make A New Directory.......................|netrw-d| D................Deleting Files or Directories..............|netrw-D| <c-h>............Edit File/Directory Hiding List............|netrw-ctrl-h| i................Change Listing Style.......................|netrw-i| <c-l>............Refreshing the Listing.....................|netrw-ctrl-l| o................Browsing with a Horizontal Split...........|netrw-o| p................Use Preview Window.........................|netrw-p| P................Edit in Previous Window....................|netrw-p| q................Listing Bookmarks and History..............|netrw-q| r................Reversing Sorting Order....................|netrw-r| < (etc)
es_es: MAPS netrw-maps <F1>.............Ayuda......................................|netrw-help| <cr>.............Explorar...................................|netrw-cr| <del>............Borrar archivos o directorios..............|netrw-delete| -................Subir......................................|netrw--| a................Ocultar archivos o directorios.............|netrw-a| mb...............Marcar un directorio como favorito.........|netrw-mb| gb...............Pasar a un directorio favorito.............|netrw-gb| c................Hacer del directorio explorado el actual...|netrw-c| d................Crear un directorio........................|netrw-d| D................Borrar archivos o directorios..............|netrw-D| <c-h>............Editar la lista de archivos/dir ocultos....|netrw-ctrl-h| i................Cambiar el estilo de la lista..............|netrw-i| <c-l>............Refrescar la lista.........................|netrw-ctrl-l| o................Explorar con una división horizontal.......|netrw-o| p................Usar la ventana de previsualización........|netrw-p| P................Editar en la anterior ventana..............|netrw-p| q................Listar favoritos y el histório.............|netrw-q| r................Invertir el orden de agrupación............|netrw-r| < (etc)

source: The <F1> key thus brings you to a netrw directory browsing contents help page. It's a regular help page; use the usual |CTRL-]| to jump to tagged help items and |CTRL-O| to jump back.
es_es: La tecla <F1> le lleva un directorio netrw explorando los contenidos de la página de ayuda. Ésta es una página de ayuda normal; use |CTRL-]| para saltar entre los elementos de ayuda etiquetados, y |CTRL-O| para volver atrás.

source: <enter> Open the file in the current window. |netrw-cr| o Horizontally split window and display file |netrw-o| v Vertically split window and display file |netrw-v| p Use the |preview-window| |netrw-p| P Edit in the previous window |netrw-P| t Open file in a new tab |netrw-t|
es_es: <enter> Abrir el archivo en la ventana actual. |netrw-cr| o Dividir la ventana horizontalmente y mostrar el archivo |netrw-o| v Dividir la ventana verticalmente y mostrar el archivo |netrw-v| p Usar la |preview-window| (ventana de previsualización) |netrw-p| P Editar en la ventana anterior |netrw-P| t Abrir el archivo en una nueva pestaña |netrw-t|

source: i Controls listing style (thin, long, wide, and tree). The long listing includes size and date information. s Repeatedly pressing s will change the way the files are sorted; one may sort on name, modification time, or size. r Reverse the sorting order.
es_es: i Control el formato de la lista (estrecho, largo, ancho, y árbol). El formato de lista largo incluye información de tamaño y fecha. s Pulsar «s» repetidas veces modifica la manera en que se organizan los archivos; una para ordenar por nombre, fecha de modificación, o tamaño. r Invertir el orden de presentación.

source: c Change Vim's notion of the current directory to be the same as the browser directory. (see |g:netrw_keepdir| to control this, too) R Rename the file or directory under the cursor; a prompt will be issued for the new name. D Delete the file or directory under the cursor; a confirmation request will be issued. mb gb Make bookmark/goto bookmark
es_es: c Cambiar la noción de directorio actual de Vim, para coincidir con el directorio del navegador. (Véase |g:netrw_keepdir| para controlare esto también.) R Renombrar el archivo o directorio bajo el cursor; verá una ventana de dialogo para introducir el nombre nuevo. D Borrar el archivo o directorio bajo el cursor; un dialogo le pedirá confirmación. mb gb Crear marcador/ir a bookmark

source: :Explore [directory] Browse specified/current directory :NetrwSettings A comprehensive list of your current netrw settings with help linkage.
es_es: :Explore [directory] Explorar el directorio actual o especificado :NetrwSettings Una completa lista de su configuración actual de netrw, con enlaces de ayuda.

source: The netrw browser is not limited to just your local machine; one may use urls such as: (that trailing / is important)
es_es: El explorador netrw no esta limitado al sistema local; puede usar direcciones url tales como: (espacio en blanco / es importante).

source: :Explore ftp://somehost/path/to/dir/ :e scp://somehost/path/to/dir/
es_es: :Explore ftp://sistema_anfitrión/ruta/al/directorio/ :e scp://sistema_anfitrión/ruta/al/directorio/

source: *22.2* The current directory
es_es: *22.2* El directorio actual

source: :edit VeryLongFileName/file1.txt :edit VeryLongFileName/file2.txt :edit VeryLongFileName/file3.txt
es_es: :edit Nombre_Largo_de_Directorio/archivo1.txt :edit Nombre_Largo_de_Directorio/archivo2.txt :edit Nombre_Largo_de_Directorio/archivo3.txt

source: :cd VeryLongFileName :edit file1.txt :edit file2.txt :edit file3.txt
es_es: :cd Nombre_Largo_de_Directorio :edit archivo1.txt :edit archivo2.txt :edit archivo3.txt

source: The ":cd" command changes the current directory. You can see what the current directory is with the ":pwd" command: >
es_es: La orden «:cd» le permite cambiar a otro directorio. Puede ver cual es el directorio actual con la orden «:pwd»: >

source: :pwd /home/Bram/VeryLongFileName
es_es: :pwd /home/Bram/Nombre_Largo_de_Directorio

source: Vim remembers the last directory that you used. Use "cd -" to go back to it. Example: >
es_es: Vim recuerda el último directorio que usó. Use «cd -» para volver a él. Ejemplo: >()

source: :pwd /home/Bram/VeryLongFileName :cd /etc :pwd /etc :cd - :pwd /home/Bram/VeryLongFileName :cd - :pwd /etc
es_es: :pwd /home/Bram/Nombre_Largo_de_Directorio :cd /etc :pwd /etc :cd - :pwd /home/Bram/Nombre_Largo_de_Directorio :cd - :pwd /etc

source: When you split a window, both windows use the same current directory. When you want to edit a number of files somewhere else in the new window, you can make it use a different directory, without changing the current directory in the other window. This is called a local directory. >
es_es: Cuando divide una ventana, ambas ventanas usan el mismo directorio actual. Cuando desea editar un nombre de archivos en otra ubicación en la ventana nueva, puede usar un directorio diferente, sin cambiar el directorio actual en la otra ventana. A esto se le llama el directorio local. >

source: :pwd /home/Bram/VeryLongFileName :split :lcd /etc :pwd /etc CTRL-W w :pwd /home/Bram/VeryLongFileName
es_es: :pwd /home/Bram/Nombre_Largo_de_Archivo :split :lcd /etc :pwd /etc CTRL-W w :pwd /home/Bram/Nombre_Largo_de_Archivo

source: So long as no ":lcd" command has been used, all windows share the same current directory. Doing a ":cd" command in one window will also change the current directory of the other window. For a window where ":lcd" has been used a different current directory is remembered. Using ":cd" or ":lcd" in other windows will not change it. When using a ":cd" command in a window that uses a different current directory, it will go back to using the shared directory.
es_es: Mientras no use ninguna orden «:lcd», todas las ventanas comparten el directorio actual. Ejecutar una orden «:cd» en una ventana cambiará también el directorio de la otra ventana. Si se usa con «:lcd» con una ventana, se recordará otro directorio actual. Usar «:cd» o «:lcd» en otras ventanas no modificará esta. Cuando use la orden «:cd» en una ventana que usa un directorio actual diferente, esta volverá al directorio compartido.

source: *22.3* Finding a file
es_es: *22.3* Encontrar un archivo

source: You want to see what is in that "inits.h" file. Move the cursor on the name of the file and type: >
es_es: Desea ver el contenido del archivo «inits.h». Desplace el cursor al nombre del archivo y teclee: >

source: Vim will find the file and edit it. What if the file is not in the current directory? Vim will use the 'path' option to find the file. This option is a list of directory names where to look for your file. Suppose you have your include files located in "c:/prog/include". This command will add it to the 'path' option: >
es_es: Vim encontrará el archivo y lo editará. ¿Y en el caso de que el archivo no está en el directorio actual? Vim usará la opción 'path' (ruta) para encontrar el archivo. Esta opción es una lista de nombres de directorio donde buscar su archivo. Suponga que tiene sus archivos include en «c:/prog/include». Esta orden la añadiría a la opción 'path': >

source: This directory is an absolute path. No matter where you are, it will be the same place. What if you have located files in a subdirectory, below where the file is? Then you can specify a relative path name. This starts with a dot: > :set path+=./proto
es_es: Este directorio es una ruta absoluta. No importa donde esté, tendrá la misma ubicación. ¿Y en el caso de que tiene archivos ubicados en un subdirectorio, debajo de donde está el archivo? Puede especificar en este caso un nombre de ruta relativo. Esto empieza con un punto: > :set path+=./proto

source: This tells Vim to look in the directory "proto", below the directory where the file in which you use "gf" is. Thus using "gf" on "inits.h" will make Vim look for "proto/inits.h", starting in the directory of the file. Without the "./", thus "proto", Vim would look in the "proto" directory below the current directory. And the current directory might not be where the file that you are editing is located.
es_es: Esto hace que Vim mire en el directorio «proto», debajo del directorio en el que está el archivo sobre el que usa «gf». Por ello, usar «gf» con «inits.h» hace que Vim busque «proto/inits.h», empezando por el directorio del archivo. Sin el «./», en este caso «proto», Vim buscará en el directorio «proto» por debajo del directorio actual. Y puede que el directorio actual no sea en el que se ubica el archivo que está editando.

source: The 'path' option allows specifying the directories where to search for files in many more ways. See the help on the 'path' option. The 'isfname' option is used to decide which characters are included in the file name, and which ones are not (e.g., the " character in the example above).
es_es: La opción 'path' permite especificar de muchas más maneras los directorios donde buscar los archivos. Véase la ayuda de la opción 'path'. La opción 'isfname' se usa para decidir qué caracteres están incluidos en el nombre del archivo, y cuales no lo están (p. ej., el carácter «"» en el ejemplo anterior).

source: Vim will then use the 'path' option to try and locate the file. This is the same as the ":edit" command, except for the use of 'path'.
es_es: Vim usará entonces la opción 'path' para buscar y ubicar el archivo. Esto equivale a la orden «:edit», excepto por el uso de 'path'.
